package game.interf;

import static game.interf.Inter.*;

public final class EnterpriseMenu {

    private EnterpriseMenu() { }

    public static void serveBarbershop() {
        System.out.println("\n" +
                "  ╔════════════════════════════════════════════════════════════════════════╗\n" +
                "  ║" + BOLD + PURPLE + "                💈 ПАРИКМАХЕРСКАЯ: 'ОТРЕЗАННОЕ УХО'           " + RESET + "          ║\n" +
                "  ╠════════════════════════════════════════════════════════════════════════╣\n" +
                "  ║ " + YELLOW + "1. " + CYAN + "Простая стрижка " + RESET + "(10 золота, 10 мин)" +
                String.format("%33s", "") + "║\n" +
                "  ║ " + YELLOW + "2. " + CYAN + "Модная стрижка  " + RESET + "(40 золота, 30 мин) – сокращает время захвата замка " + "║\n" +
                "  ║ " + YELLOW + "3. " + CYAN + "Выйти из здания" + RESET + String.format("%46s", "") + "       ║\n" +
                "  ╚════════════════════════════════════════════════════════════════════════╝\n");
    }

    public static void serveHotel() {
        System.out.println("\n" +
                "  ╔════════════════════════════════════════════════════════════════╗\n" +
                "  ║" + BOLD + PURPLE + "           🏨 ОТЕЛЬ: 'У ПОГИБШЕГО АЛЬПИНИСТА'         " + RESET + "          ║\n" +
                "  ╠════════════════════════════════════════════════════════════════╣\n" +
                "  ║ " + YELLOW + "1. " + CYAN + "Короткий отдых    " + RESET + "(50 золота, 1 день) – +2 к здоровью" +
                String.format("%7s", "") + "║\n" +
                "  ║ " + YELLOW + "2. " + CYAN + "Длинный отдых     " + RESET + "(100 золота, 3 дня) – +3 к здоровью" +
                String.format("%5s", "") + "  ║\n" +
                "  ║ " + YELLOW + "3. " + CYAN + "Выйти из здания" + RESET + String.format("%38s", "") + "       ║\n" +
                "  ╚════════════════════════════════════════════════════════════════╝\n");
    }

    public static void serveRestaurant() {
        System.out.println("\n" +
                "  ╔════════════════════════════════════════════════════════════════╗\n" +
                "  ║" + BOLD + PURPLE + "             🍽 КАФЕ: 'СЫРНИКИ ОТ ТЁТИ ГЛАШИ'         " + RESET + "          ║\n" +
                "  ╠════════════════════════════════════════════════════════════════╣\n" +
                "  ║ " + YELLOW + "1. " + CYAN + "Просто перекус     " + RESET + "(20 золота, 15 мин) – +2 к передвижению" +
                String.format("%2s", "") + "║\n" +
                "  ║ " + YELLOW + "2. " + CYAN + "Плотный обед       " + RESET + "(30 золота, 30 мин) – +3 к передвижению" +
                String.format("%2s", "") + "║\n" +
                "  ║ " + YELLOW + "3. " + CYAN + "Выйти из здания" + RESET + String.format("%38s", "") + "       ║\n" +
                "  ╚════════════════════════════════════════════════════════════════╝\n");
    }
}
